{
    "fullName": {
        "message": "SponsorBlock Spotifylle - Ohita sponsoroinnit",
        "description": "Name of the extension."
    },
    "Description": {
        "message": "Ohita sponsoroinnit, mainokset ja muuta Spotify podcasteissa. Ilmoita kuuntelemiesi jaksojen sponsorit ja säästä muiden aikaa.",
        "description": "Description of the extension."
    },
    "showAutogeneratedChapters": {
        "message": "Näytä Spotifyn automaattisesti luomat luvut"
    },
    "sponsorFound": {
        "message": "Tällä jaksolla on osioita tietokannassa!"
    },
    "noVideoID": {
        "message": "Mediaa ei löytynyt",
        "description": "Displayed when the media player is completely empty / when no videoID could be found."
    },
    "wrongContentType": {
        "message": "Spot SponsorBlock tukee vain podcasteja"
    },
    "isExternalDevice": {
        "message": "Spot SponsorBlock ei toimi ulkoisella laitteella toistettaessa"
    },
    "showButtons": {
        "message": "Näytä painikkeet Spotify-soittimessa"
    },
    "hideButtonsDescription": {
        "message": "This hides the buttons that appear on the Spotify player to submit skip segments."
    },
    "showInfoButton": {
        "message": "Show info button on Spotify player"
    },
    "showDeleteButton": {
        "message": "Show delete button on Spotify player"
    },
    "whatQueryByHashPrefix": {
        "message": "Sen sijaan, että videoID:tä käyttäen pyydettäisiin osioita palvelimelta, videoID:n tiivisteen 4 ensimmäistä merkkiä lähetetään. Palvelin lähettää takaisin dataa kaikista jaksoista, joilla on samankaltaiset tiivisteet."
    },
    "longDescription": {
        "message": "Spot SponsorBlock lets you skip over sponsors, intros, outros, advertisements, and other annoying parts of Spotify podcasts. Spot SponsorBlock is a crowdsourced browser extension that lets anyone submit the start and end times of sponsored segments and other segments of Spotify podcasts. Once one person submits this information, everyone else with this extension will skip right over the sponsored segment.",
        "description": "Full description of the extension on the store pages."
    },
    "full": {
        "message": "Koko jakso",
        "description": "Used for the name of the option to label an entire episode as sponsor or self promotion."
    },
    "showTimeWithSkipsDescription": {
        "message": "This time appears in brackets next to the current time that is next to the Seek Bar. This shows the total episode duration minus any segments. This includes segments marked as only \"Show In Seek Bar\"."
    },
    "the": {
        "message": "",
        "description": "Used for displaying 'Created By The Spot SponsorBlock Team' in options and help page"
    },
    "team": {
        "message": "Tiimi",
        "description": "Used for displaying 'Created By The Spot SponsorBlock Team' in options and help page"
    },
    "optionsInfo": {
        "message": "Disable auto skip, hide buttons and more."
    },
    "enableManualSkipOnFullVideo": {
        "message": "Use manual skip when a full episode label exists"
    },
    "whatManualSkipOnFullVideo": {
        "message": "For people who want to listen to the episode uninterrupted if it is fully sponsored or self promotion."
    },
    "customServerAddressDescription": {
        "message": "The address Spot SponsorBlock uses to make calls to the server.\nUnless you have your own server instance, this should not be changed."
    },
    "copyDebugInformationOptions": {
        "message": "Copies information to the clipboard to be provided to a developer when raising a bug / when a developer requests it. Sensitive information such as your user ID, whitelisted shows, and custom server address have been removed. However it does contain information such as your useragent, browser, operating system, and extension version number. "
    },
    "category_selfpromo_guideline2": {
        "message": "Free shoutouts that don't add to the episode"
    },
    "category_exclusive_access_description": {
        "message": "Only for labeling entire episodes. Used when an episode showcases a product, service or location that they've received free or subsidized access to."
    },
    "category_exclusive_access_pill": {
        "message": "This episode showcases a product, service or location that they've received free or subsidized access to",
        "description": "Short description for this category"
    },
    "category_exclusive_access_guideline1": {
        "message": "Entire episode showcases something with free or subsidized access"
    },
    "category_interaction": {
        "message": "Vuorovaikutusmuistutus (seuraaminen)"
    },
    "category_interaction_description": {
        "message": "When there is a short reminder to rate, subscribe or follow them in the middle of content. If it is long or about something specific, it should be under self promotion instead."
    },
    "category_interaction_guideline1": {
        "message": "Short reminders to rate, share or follow"
    },
    "category_intro": {
        "message": "Tauko/Intro-animaatio"
    },
    "category_intro_description": {
        "message": "An interval without actual content. Could be a pause, jingle, intro. This should not be used for transitions containing information."
    },
    "category_outro": {
        "message": "Credits/Outro"
    },
    "category_outro_description": {
        "message": "Credits or outro. Not for conclusions with information."
    },
    "category_outro_guideline1": {
        "message": "Älä sisällytä sisältöä"
    },
    "category_preview_description": {
        "message": "Collection of clips that show what is coming up in in this episode or other episodes in a series where all information is repeated later in the episode."
    },
    "category_preview_guideline1": {
        "message": "Clips that appear later, or in a future episode"
    },
    "category_preview_guideline2": {
        "message": "Recap of a previous episode"
    },
    "category_hook_description": {
        "message": "Narrated trailers for the upcoming episode, greetings and goodbyes. This should not skip conclusions with information."
    },
    "category_hook_guideline1": {
        "message": "Narrated trailers for the upcoming episode"
    },
    "category_filler_description": {
        "message": "Tangential scenes or jokes that are not required to understand the main content of the episode. This should not include segments providing context or background details. This is a very aggressive category meant for when you aren't in the mood for \"fun\"."
    },
    "category_poi_highlight_description": {
        "message": "The part of the episode that most people are looking for. Similar to \"Episode starts at x\" comments."
    },
    "category_poi_highlight_guideline3": {
        "message": "Can skip to the title"
    },
    "category_chapter_description": {
        "message": "Custom named chapters describing major sections of an episode."
    },
    "fallbackToDefault": {
        "message": "Fallback to default",
        "description": "Used in the show specific settings to fallback to the default option."
    },
    "manualSkip_POI": {
        "message": "Kysy kun jakso latautuu"
    },
    "fullVideoSegments": {
        "message": "Show an icon when an episode is entirely an advertisement",
        "description": "Referring to the category pill that is now shown on episodes that are entirely sponsor or entirely selfpromo"
    },
    "fullVideoLabelsOnThumbnails": {
        "message": "Näytä tunnisteet myös jaksosivuilla",
        "description": "Referring to the category pill that is shown on episodes that are entirely sponsor or entirely selfpromo on episode or podcast show pages."
    },
    "channelDataNotFound": {
        "description": "This error appears in an alert when they try to whitelist a show and the extension is unable to determine what show they are looking at.",
        "message": "Show ID is not loaded yet. This could be caused by changes in the Spotify layout, if you think so, make a comment here:"
    },
    "forceChannelCheck": {
        "message": "Force podcast show check before skipping"
    },
    "whatForceChannelCheck": {
        "message": "By default, it will skip segments right away before it even knows what the show is. By default, some segments at the start of the episode might be skipped on whitelisted shows. Enabling this option will prevent this but making all skipping have a slight delay as getting the showID can take some time. This delay might be unnoticeable if you have fast internet."
    },
    "forceChannelCheckPopup": {
        "message": "Consider Enabling \"Force podcast show check before skipping\""
    },
    "fullVideoTooltipWarning": {
        "message": "This segment is large. If the whole episode is about one topic, then change from \"Skip\" to \"Full Episode\". See the guidelines for more information."
    },
    "categoryPillTitleText": {
        "message": "This entire episode is labeled as this category and is too tightly integrated to be able to separate"
    },
    "supportSponsorBlock": {
        "message": "Support our development of Spot SponsorBlock"
    },
    "helpPageThanksForInstalling": {
        "message": "Kiitos, kun asensit Spot SponsorBlockin."
    },
    "helpPageFeatureDisclaimer": {
        "message": "Many features are disabled by default. If you want to skip intros, outros, etc., enable them below. You can also hide/show UI elements."
    },
    "helpPageSubmitting1": {
        "message": "Submitting can be made by clicking the SponsorBlock segment button in the media player."
    },
    "categoryPillNewFeature": {
        "message": "New! See when an episode is entirely sponsored or self-promotion"
    },
    "youtubeKeybindWarning": {
        "message": "Tämä on Spotifyn sisäänrakennettu pikanäppäin. Haluatko varmasti käyttää sitä?"
    },
    "videosSingular": {
        "message": "jaksossa",
        "description": "Example: You currently have 3 unsubmitted segments on 1 *episode*"
    },
    "videosPlural": {
        "message": "jaksossa",
        "description": "Example: You currently have 12 unsubmitted segments on 5 *episodes*"
    },
    "videoID": {
        "message": "Episode ID",
        "description": "Header of the unsubmitted segments list"
    },
    "segmentFetchFailureWarning": {
        "message": "Warning: The server hasn't responded with segments yet. There might actually be segments in this episode already submitted but you just haven't received them due to issues with the server."
    },
    "FillerWarning": {
        "message": "Warning: This is an incredibly aggressive category. You most likely will have to unskip stuff, or disable it sometimes. Be warned that many episodes have over 50% or more of the episode skipped! However, remember that there are still specific guidelines to follow when submitting.",
        "description": "Warning that appears when enabling the filler tangent category"
    },
    "ChannelAllowlist": {
        "message": "Show-specific settings"
    },
    "ChannelListInstructionsSB": {
        "message": "Add shows that should use this alternative skip profile by clicking the button in the popup on an episode made by that show. The list of shows will appear below.",
        "description": "Instructions for the show-specific settings feature to configure settings for specific shows"
    },
    "videoIDWrongWhenSubmittingError": {
        "message": "Something has gone wrong with the episodeID detection. Please try refreshing before submitting to ensure it gets submitted for the correct episode. If this is happening a lot, please send a report of this along with the other extensions or userscripts you have installed through GitHub or discord"
    },
    "skipProfile_forJustThisVideo": {
        "message": "For just this episode",
        "description": "Option in skip profiles to set this skip profile as the active one for just this episode"
    },
    "skipProfile_forThisChannel": {
        "message": "For this show",
        "description": "Option in skip profiles to set this skip profile as the active one for this show"
    },
    "WhitelistedChannels": {
        "message": "Whitelisted shows",
        "description": "Name used when converting old whitelisted shows to skip profiles"
    },
    "addChannelToSkipProfile": {
        "message": "Add show to skip profile"
    },
    "editChannelsSkipProfile": {
        "message": "Change this show's skip profile"
    }
}